hellenavilarosa/breakout_stm32_game/Src/main.c
}
int checa_borda_esq(int x, int y){

	if(x-2 <= 0){//limites do display esquerdo
		/*goto_XY(0,0);
		string_LCD("esq");
		do{
			movimentaBola(&x,&y,'D','D');
		}while((!checa_bateu_barra()) && (!perdeu_jogo()) && (!checa_borda_cim(x,y)) && (!checa_borda_dir(x,y)));*/
		return 1;
	}
	return 0;
}

int checa_borda_cim(int x, int y){
	if(y-2 <= 0){//limite do display superior
/*
		goto_XY(0,0);
		string_LCD("cim");
		do{
			movimentaBola(&x,&y,'D','D');
		}while((!checa_bateu_barra()) && (!perdeu_jogo()) && (!checa_borda_esq(x,y)) && (!checa_borda_dir(x,y)));
*/
		return 1;
	}

	return 0;
}

int checa_limites_tela(int x, int y){
	if((checa_borda_esq(x,y)==1 || checa_borda_dir(x,y)==1 || checa_borda_cim(x,y)==1 ))
		return 1;
	else
		return 0;
}

void inicializa_bola(int *x,int *y){
	uint32_t perdeu_=0;
	posicao_bola_x[0]=*x;
	posicao_bola_y[0]=*y;
	//flag_pos_x=x;
	desenha_circulo(*x,*y,2,1);//desenha a nova bola
	while(perdeu_== 0){
		desenha_circulo(*x,*y,2,0);//apaga
			*y=(*y)+1;
			desenha_circulo(*x,*y,2,1);//desenha a nova bola
			posicao_bola_x[0]=*x;
			posicao_bola_y[0]=*y;
			HAL_Delay(200);
		//checando se a bola esta batendo na barra
		if(checa_bateu_barra()){
				perdeu_=1;
		}
		else{
			perdeu_jogo();
		}
	}
}

void restart(int *x, int *y){
	score=0;
	limpa_LCD();
	goto_XY(0,0);
	string_LCD("              Press the Joystick to restart                      ");
	//imprime_LCD();
	while(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15)){ // enquando nao pressionar joystick fica travado
				semente++;		// semente para o gerador de n�meros pseudoaleatorios
								// pode ser empregado o ADC lendo uma entrada flutuante para gerar a semente.
	}
	HAL_Delay(200);
	limpa_LCD();
	perdeu=1;
	HAL_Delay(100);
	desenha_quadradinhos();
	HAL_Delay(100);
	inicializa_bola(&(*x),&(*y));
}
void vTask_Bola (void *pvParameters){
	uint32_t x=0;
	uint32_t y=25;
	uint32_t flag_pos_y=0;
	uint32_t flag_=0,flag_pos_x=0,flag_b=0;
	uint32_t perdeu_=0,aleatorio=0,trocouSentido=0;


	srand(semente); // numeros aleatorios
	x=rand()%82;

	inicializa_bola(&x,&y);
	flag_pos_x=x;

	while (1){
		trocouSentido = 0;
		while(!perdeu_jogo()){
//QUANDO BATE NA PARTE ESQUERDA DA BARRA (vindo sempre de cima)
			if((posicao_base_x[0] <= posicao_bola_x[0] && posicao_bola_x[0] <= (posicao_base_x[0]+10)) ){
				// se a bola estiver vindo da direita
				posicao_bola_x[0]=x;
				posicao_bola_y[0]=y;
				if(flag_pos_x>40){
					aleatorio=rand()%4;
					apagaBola;
					x -= aleatorio;
					while((!detecta_colisao_quadrados()) && trocouSentido == 0){ ///enquanto nao bater na barra de cima
						if (checa_limites_tela(x,y)){
							trocouSentido = 1;
						}
		/*
						if(posicao_bola_x[0]+2 >= 84){//limites do display
							trocouSentido = 1;
							do{
								movimentaBola(&x,&y,'E','D');
							}while((!checa_bateu_barra()) && (!perdeu_jogo()));
						}
		*/				else{
							movimentaBola(&x,&y,'E','S');
						}
					}
				}
				//se a bola estiver vindo da esquerda
				else if(flag_pos_x<=40){
					aleatorio=rand()%4;
					apagaBola;
					x += aleatorio;
					while((!detecta_colisao_quadrados()) && trocouSentido == 0){ //enquanto nao bater no quadrado de cima
						if (checa_borda_esq(x,y)==1 || checa_borda_dir(x,y)==1 || checa_borda_cim(x,y)==1 ){
							trocouSentido = 1;
						}

					/*	if(posicao_bola_x[0]-2 <= 1){
							trocouSentido = 1;
							do{
								movimentaBola(&x,&y,'E','D');
							}while((!checa_bateu_barra()) && (!perdeu_jogo()));
						}*/
						else{
							movimentaBola(&x,&y,'D','S'); //movimenta bola para direita
						}
					}
				}

			//BOLA BATENDO NOS QUADRADINOS DE CIMA
				if(detectou_colisao==1){ // caso bata nos quadrados ativa a flag
					flag_b=1;
					posicao_bola_x[0]=x;
					posicao_bola_y[0]=y;
					flag_pos_x=x;

					while(flag_b==1){// caso bateu nos quadrados ele vai voltar na diagonal até que a flag volte para 0
						if(flag_pos_x>40){ // vindo da direita
							movimentaBola(&x,&y,'E','D');
						}
						if(flag_pos_x<=40){//vindo da esquerda
							movimentaBola(&x,&y,'D','D');
						}
						//checa se bateu na barra
						if(checa_bateu_barra()){ // quando bater na barra flag =0 sai do while
							flag_b=0;
							detectou_colisao=0;
						}
						//se nao tocou na barra-> perdeu
						if(perdeu_jogo()){
							flag_b=0;
							detectou_colisao=0;
						}
						if(checa_limites_tela(x,y)){
							flag_b = 0;
							trocouSentido = 1;
						}

					}
					flag_pos_x=x;
					posicao_bola_x[0]=x;
					posicao_bola_y[0]=y;
				}
			}
//PARTE DIREITA DA BARRA
			else if((posicao_base_x[1] >= posicao_bola_x[0] && posicao_bola_x[0] > (posicao_base_x[1]-10))){
				// se a bola estiver vindo da direita
				posicao_bola_x[0]=x;
				posicao_bola_y[0]=y;
				if(flag_pos_x>40){
					aleatorio=rand()%4;
					apagaBola;
					x += aleatorio;
					while((!detecta_colisao_quadrados()) && trocouSentido == 0){ ///enquanto nao bater na barra de cima
						if (checa_borda_esq(x,y)==1 || checa_borda_dir(x,y)==1 || checa_borda_cim(x,y)==1 ){
							trocouSentido = 1;
						}
						/*if(posicao_bola_x[0]+2 >= 84){
							trocouSentido = 1;
							do{
								movimentaBola(&x,&y,'E','D'); //movimenta bola para esquerda
							  }while((!checa_bateu_barra()) && (!perdeu_jogo()));
						}*/
						else{
							movimentaBola(&x,&y,'D','S');
						}
					}
				}
				//se a bola estiver vindo da esquerda
				else if(flag_pos_x<=40){
					aleatorio=rand()%4;
					apagaBola;
					x -= aleatorio;
					while((!detecta_colisao_quadrados()) && (trocouSentido == 0)){ //enquanto nao bater no quadrado de cima
						if (checa_limites_tela(x,y)){
							trocouSentido = 1;
						}

/*						if(posicao_bola_x[0]-2 <= 1){
							trocouSentido = 1;
							do{
								movimentaBola(&x,&y,'E','D'); //movimenta bola para esquerda
							}while((!checa_bateu_barra()) && (!perdeu_jogo()));
						}*/
						else{
							movimentaBola(&x,&y,'E','S');
						}
					}
				}
				flag_pos_x=x;
				posicao_bola_x[0]=x;
				posicao_bola_y[0]=y;

