hellenavilarosa/breakout_stm32_game/Src/main.c
				//BOLA BATENDO NOS QUADRADINOS DE CIMA
				if(detectou_colisao==1 ){ // caso bata nos quadrados ativa a flag
					flag_=1;
					posicao_bola_x[0]=x;
					posicao_bola_y[0]=y;
					while(flag_==1){// caso bateu nos quadrados ele vai voltar na diagonal até que a flag volte para 0
						if(flag_pos_x>40){ // vindo da direita
							movimentaBola(&x,&y,'D','D');
						}
						else if(flag_pos_x<=40){//vindo da esquerda
							movimentaBola(&x,&y,'E','D');
						}
						//checa se bateu na barra
						else if(checa_bateu_barra()){ // quando bater na barra flag =0 sai do while
							flag_=0;
							detectou_colisao=0;

						}
						//se nao tocou na barra-> perdeu
						else if(perdeu_jogo()){
							flag_=0;
							detectou_colisao=0;
						}
						if(checa_limites_tela(x,y)){
							flag_ = 0;
							trocouSentido = 1;
						}
					}
					flag_pos_x=x;
					posicao_bola_x[0]=x;
					posicao_bola_y[0]=y;
				}
			}
			if(trocouSentido == 1){
				flag_= 1;
				flag_pos_x=x;
				flag_pos_y=y;
				trocouSentido = 0;
				while(flag_==1){// caso bateu nos quadrados ele vai voltar na diagonal até que a flag volte para 0
					//checa se bateu na barra
					if(checa_bateu_barra()){ // quando bater na barra flag =0 sai do while
						flag_=0;
						detectou_colisao=0;
					}
					//se nao tocou na barra-> perdeu
					else if(perdeu_jogo()){
						flag_=0;
						detectou_colisao=0;
					}
					else if (checa_borda_cim(flag_pos_x,flag_pos_y)){
						if(flag_pos_x>40){
							movimentaBola(&x,&y,'E','D');
						}
						else{
							movimentaBola(&x,&y,'D','D');
						}
					}
					else if (checa_borda_dir(flag_pos_x,flag_pos_y)){
						movimentaBola(&x,&y,'E','D');
					}
					else if (checa_borda_esq(flag_pos_x,flag_pos_y)){
						movimentaBola(&x,&y,'D','D');
					}
					if(checa_limites_tela(x,y)){
						flag_ = 0;
						trocouSentido = 1;
					}
				}
			}
		}
		srand(semente); // numeros aleatorios
		x=rand()%82;
		y=25;
		restart(&x,&y);
/*		limpa_LCD();
		goto_XY(0,0);
		string_LCD("              Press the Joystick to restart                      ");
		//imprime_LCD();
		while(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15)){ // enquando nao pressionar joystick fica travado
					semente++;		// semente para o gerador de n�meros pseudoaleatorios
									// pode ser empregado o ADC lendo uma entrada flutuante para gerar a semente.
		}
		HAL_Delay(200);
		limpa_LCD();
		perdeu=1;
		HAL_Delay(100);
		desenha_quadradinhos();
		x=40;
		y=25;
		HAL_Delay(100);
		inicializa_bola(&x,&y);*/
	}
}


void vTask_Base (void *pvParameters){
	struct pontos_t t;
	t.x2 =50; //sup_x  largura da linha (fica maior quando aumenta o numero)
	t.y2 =45; //sup_y //altura (fica maior quando diminui o numero)
	t.x1 = 30; //inf_x // comprimento (linha maior quando diminui o numero
	t.y1 = 50; //inf_y //
	desenha_retangulo(&t,3);

	while (1){
		posicao_base_x[0]=t.x1;
		posicao_base_x[1]=t.x2;

		if(valor_ADC[1]>2500){//direita
			if(posicao_base_x[1]>=84){//delimitando a barra da tela
				desenha_retangulo(&t,2);
				t.x2=84;
				t.x1=64;

			}
			else{
				desenha_retangulo(&t,2);
				t.x2+=1;
				t.x1+=1;
			}
			desenha_retangulo(&t,3);
			HAL_Delay(50);
		}
		posicao_base_x[0]=t.x1;
		posicao_base_x[1]=t.x2;

		if(valor_ADC[1]<1000){//esquerda
			if(posicao_base_x[0]<=0){//delimitando a barra na tela
				desenha_retangulo(&t,2);
				t.x2=20;
				t.x1=0;
			}
			else{
				desenha_retangulo(&t,2);
				t.x2-=1;
				t.x1-=1;
			}

			desenha_retangulo(&t,3);
			HAL_Delay(20);
		}
		if(perdeu==1){
			t.x2 =50; //sup_x  largura da linha (fica maior quando aumenta o numero)
			t.y2 =45; //sup_y //altura (fica maior quando diminui o numero)
			t.x1 = 30; //inf_x // comprimento (linha maior quando diminui o numero
			t.y1 = 50; //inf_y //
			desenha_retangulo(&t,3);
			perdeu=0;
		}

	}
}



//---------------------------------------------------------------------------------------------------
/* USER CODE END 0 */

/**
  * @brief  The application entry point.
  *
  * @retval None
  */
int main(void)
{
  /* USER CODE BEGIN 1 */

  /* USER CODE END 1 */



  /* MCU Configuration----------------------------------------------------------*/

  /* Reset of all peripherals, Initializes the Flash interface and the Systick. */
  HAL_Init();

  /* USER CODE BEGIN Init */

  /* USER CODE END Init */

  /* Configure the system clock */
  SystemClock_Config();

  /* USER CODE BEGIN SysInit */

  /* USER CODE END SysInit */

	/* Initialize all configured peripherals */
	MX_GPIO_Init();
	MX_DMA_Init();
	MX_ADC1_Init();

	/* USER CODE BEGIN 2 */
	// inicializa LCD 5110
	inic_LCD();
	limpa_LCD();

	// --------------------------------------------------------------------------------------
	// inicializa tela

	goto_XY(0,0);
	string_LCD("               Press the Joystick to start THE BREAKOUT GAME :)                     ");


	HAL_ADC_Start_DMA(&hadc1,(uint32_t*)ADC_buffer,2);
	HAL_ADC_Start_IT(&hadc1);

	imprime_LCD();




	while(HAL_GPIO_ReadPin(GPIOC, GPIO_PIN_15)){ // enquando nao pressionar joystick fica travado
				semente++;		// semente para o gerador de n�meros pseudoaleatorios
								// pode ser empregado o ADC lendo uma entrada flutuante para gerar a semente.
	}




//	init_LFSR(semente_PRNG);	// inicializacao para geracao de numeros pseudoaleatorios
	//rand_prng = prng_LFSR();	// sempre q a funcao prng() for chamada um novo nr � gerado.


	//escreve2fb((unsigned char *)dragon);
	HAL_Delay(1000);
	limpa_LCD();
//	limpa_LCD();
//	imprime_LCD();

	/* USER CODE END 2 */

  /* USER CODE BEGIN RTOS_MUTEX */
  /* add mutexes, ... */
  /* USER CODE END RTOS_MUTEX */

  /* USER CODE BEGIN RTOS_SEMAPHORES */
  /* add semaphores, ... */
  /* USER CODE END RTOS_SEMAPHORES */

  /* USER CODE BEGIN RTOS_TIMERS */
  /* start timers, add new ones, ... */
  /* USER CODE END RTOS_TIMERS */

	/* Create the thread(s) */
	/* definition and creation of defaultTask */
	// osThreadDef(defaultTask, StartDefaultTask, osPriorityNormal, 0, 128);
	// defaultTaskHandle = osThreadCreate(osThread(defaultTask), NULL);

	/* USER CODE BEGIN RTOS_THREADS */
	xTaskCreate(vTask_LCD_Print, "Task 1", 100, NULL, 1,NULL);
//	xTaskCreate(vTask_Nr_Print, "Task 2", 100, NULL, 1,NULL);
	xTaskCreate(vTask_Quadradinhos,"Task 2",100,NULL,1,NULL);
	xTaskCreate(vTask_Bola,"Task 3",100,NULL,1,NULL);
	xTaskCreate(vTask_Base,"Task 4",100,NULL,1,NULL);

//	xTaskCreate(vTask_Perdeu,"Task 5",100,NULL,2,NULL);
	/* USER CODE END RTOS_THREADS */

	/* USER CODE BEGIN RTOS_QUEUES */
	/* add queues, ... */
	/* USER CODE END RTOS_QUEUES */


	/* Start scheduler */
	// osKernelStart();
	vTaskStartScheduler();	// apos este comando o RTOS passa a executar as tarefas


  
  /* We should never get here as control is now taken by the scheduler */

